from aiogram import Router, F
from aiogram.types import Message
from Hubly_bot.keyboards.main_menu import get_start_mode_kb

router = Router()

@router.message(F.text == "🏠 В главное меню бота")
async def back_main_menu_command(message: Message):
    await message.answer('Назад!', reply_markup=get_start_mode_kb())


@router.message(F.text == "ℹ️ О сервисе")
async def get_inf_for_service(message:Message):
    ABOUT_TEXT = (
    "<b>🚀 Hubly CRM — Твой бизнес в кармане</b>\n\n"
    "Hubly — это современная экосистема для автоматизации малого и среднего бизнеса. "
    "Мы объединили мощь веб-технологий и удобство Telegram.\n\n"
    "<b>Что умеет Hubly:</b>\n"
    "✅ <b>Конструктор ниш:</b> Настраивайте модули под свой бизнес.\n"
    "✅ <b>Учет склада:</b> Контроль остатков и история движений товара.\n"
    "✅ <b>Управление продажами:</b> Быстрое оформление заказов.\n"
    "✅ <b>Magic Link:</b> Мгновенный вход в веб-панель без пароля.\n\n"
    "<i>Наша цель — сделать профессиональный учет доступным для каждого.</i>"
        )   
    await message.answer(text=ABOUT_TEXT)

@router.message(F.text == "🆘 Поддержка")
async def support_for_user(message:Message):
     await message.answer(
        text=(
            "<b>🆘 Центр поддержки Hubly</b>\n\n"
            "Если у вас возникли вопросы, трудности или вы хотите "
            "предложить идею по улучшению сервиса — напишите нашему "
            "администратору напрямую @Onh0r0sh.\n\n"
            "<i>Мы стараемся отвечать в течение часа в рабочее время.</i>"
        ),
    )